DemonTu/ALL_SmartBatterySwitch_CC2640/tirtos_simplelink_2_13_00_06/packages/ti/drivers/uart/UARTCC3200DMA.c
/*
 * Copyright (c) 2014-2015, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include <stdint.h>

/*
 * By default disable both asserts and log for this module.
 * This must be done before DebugP.h is included.
 */
#ifndef DebugP_ASSERT_ENABLED
#define DebugP_ASSERT_ENABLED 0
#endif
#ifndef DebugP_LOG_ENABLED
#define DebugP_LOG_ENABLED 0
#endif

#include <ti/drivers/ports/ClockP.h>
#include <ti/drivers/ports/DebugP.h>
#include <ti/drivers/ports/HwiP.h>
#include <ti/drivers/ports/SemaphoreP.h>
#include <ti/drivers/ports/ListP.h>

#include <ti/drivers/Power.h>
#include <ti/drivers/power/PowerCC3200.h>
#include <ti/drivers/uart/UARTCC3200DMA.h>

/* driverlib header files */
#include <inc/hw_memmap.h>
#include <inc/hw_ints.h>
#include <inc/hw_types.h>
#include <driverlib/rom.h>
#include <driverlib/rom_map.h>
#include <inc/hw_uart.h>
#include <driverlib/uart.h>
#include <driverlib/udma.h>

/* DMA can handle transfers of at most 1024 elements */
#define MAXXFERSIZE 1024

/* UARTCC3200DMA functions */
void        UARTCC3200DMA_close(UART_Handle handle);
int         UARTCC3200DMA_control(UART_Handle handle, unsigned int cmd, void *arg);
void        UARTCC3200DMA_init(UART_Handle handle);
UART_Handle UARTCC3200DMA_open(UART_Handle handle, UART_Params *params);
int         UARTCC3200DMA_read(UART_Handle handle, void *buffer, size_t size);
void        UARTCC3200DMA_readCancel(UART_Handle handle);
int         UARTCC3200DMA_readPolling(UART_Handle handle, void *buffer, size_t size);
int         UARTCC3200DMA_write(UART_Handle handle, const void *buffer, size_t size);
void        UARTCC3200DMA_writeCancel(UART_Handle handle);
int         UARTCC3200DMA_writePolling(UART_Handle handle, const void *buffer,
                                    size_t size);

/* UART function table for UARTCC3200DMA implementation */
const UART_FxnTable UARTCC3200DMA_fxnTable = {
    UARTCC3200DMA_close,
    UARTCC3200DMA_control,
    UARTCC3200DMA_init,
    UARTCC3200DMA_open,
    UARTCC3200DMA_read,
    UARTCC3200DMA_readPolling,
    UARTCC3200DMA_readCancel,
    UARTCC3200DMA_write,
    UARTCC3200DMA_writePolling,
    UARTCC3200DMA_writeCancel
};

/* Static functions */
static void UARTCC3200DMA_configDMA(UART_Handle handle, bool isWrite);
static void UARTCC3200DMA_hwiIntFxn(uintptr_t arg);

static unsigned int getPowerMgrId(unsigned int baseAddr);
static void initHw(UART_Handle handle);
static int postNotifyFxn(unsigned int eventType, uintptr_t eventArg,
        uintptr_t clientArg);

static size_t readCancel(UART_Handle handle);
static void readSemCallback(UART_Handle handle, void *buffer, size_t count);
static void startTxFifoEmptyClk(UART_Handle handle, unsigned int size, bool inISR);
static size_t writeCancel(UART_Handle handle);
static void writeFinishedDoCallback(UART_Handle handle);
static void writeSemCallback(UART_Handle handle, void *buffer, size_t count);

static const uint32_t dataLength[] = {
    UART_CONFIG_WLEN_5, /* UART_LEN_5 */
    UART_CONFIG_WLEN_6, /* UART_LEN_6 */
    UART_CONFIG_WLEN_7, /* UART_LEN_7 */
    UART_CONFIG_WLEN_8  /* UART_LEN_8 */
};

static const uint32_t stopBits[] = {
    UART_CONFIG_STOP_ONE,   /* UART_STOP_ONE */
    UART_CONFIG_STOP_TWO    /* UART_STOP_TWO */
};

static const uint32_t parityType[] = {
    UART_CONFIG_PAR_NONE,   /* UART_PAR_NONE */
    UART_CONFIG_PAR_EVEN,   /* UART_PAR_EVEN */
    UART_CONFIG_PAR_ODD,    /* UART_PAR_ODD */
    UART_CONFIG_PAR_ZERO,   /* UART_PAR_ZERO */
    UART_CONFIG_PAR_ONE     /* UART_PAR_ONE */
};

static void *uDMAControlBase = NULL;

/* Default UART params */
extern const UART_Params UART_defaultParams;


/*
 *  ======== UARTCC3200DMA_close ========
 */
void UARTCC3200DMA_close(UART_Handle handle)
{
    UARTCC3200DMA_Object           *object = handle->object;
    UARTCC3200DMA_HWAttrs const    *hwAttrs = handle->hwAttrs;

    /* Disable UART and interrupts. */
    MAP_UARTDMADisable(hwAttrs->baseAddr, UART_DMA_TX | UART_DMA_RX);
    MAP_UARTDisable(hwAttrs->baseAddr);

    if (object->hwiHandle) {
        HwiP_delete(object->hwiHandle);
    }
    if (object->writeSem) {
        SemaphoreP_delete(object->writeSem);
    }
    if (object->readSem) {
        SemaphoreP_delete(object->readSem);
    }
    if (object->txFifoEmptyClk) {
        ClockP_delete(object->txFifoEmptyClk);
    }

    Power_unregisterNotify(&object->postNotify);

    Power_releaseDependency(getPowerMgrId(hwAttrs->baseAddr));
    Power_releaseDependency(PowerCC3200_PERIPH_UDMA);

    object->opened = false;

    DebugP_log1("UART:(%p) closed", hwAttrs->baseAddr);
}

