DemonTu/ALL_SmartBatterySwitch_CC2640/tirtos_simplelink_2_13_00_06/packages/ti/drivers/uart/UARTCC3200DMA.c
/*
 *  ======== UARTCC3200DMA_control ========
 *  @pre    Function assumes that the handle is not NULL
 */
int UARTCC3200DMA_control(UART_Handle handle, unsigned int cmd, void *arg)
{
    /* No implementation yet */
    return (UART_STATUS_UNDEFINEDCMD);
}

/*
 *  ======== UARTCC3200DMA_init ========
 */
void UARTCC3200DMA_init(UART_Handle handle)
{
    UARTCC3200DMA_Object *object = handle->object;

    object->opened = false;
}

/*
 *  ======== UARTCC3200DMA_open ========
 */
UART_Handle UARTCC3200DMA_open(UART_Handle handle, UART_Params *params)
{
    uintptr_t                    key;
    UARTCC3200DMA_Object        *object = handle->object;
    UARTCC3200DMA_HWAttrs const *hwAttrs = handle->hwAttrs;
    SemaphoreP_Params            semParams;
    HwiP_Params                  hwiParams;
    ClockP_Params                clockParams;

    /* If params are NULL use defaults. */
    if (params == NULL) {
        params = (UART_Params *) &UART_defaultParams;
    }

    /* Timeouts cannot be 0 */
    DebugP_assert((params->writeTimeout != 0) && (params->readTimeout != 0));

    /* Check that a callback is set */
    DebugP_assert((params->readMode != UART_MODE_CALLBACK) ||
                  (params->readCallback != NULL));
    DebugP_assert((params->writeMode != UART_MODE_CALLBACK) ||
                  (params->writeCallback != NULL));

    /* Disable preemption while checking if the UART is open. */
    key = HwiP_disable();

    /* Check if the UART is open already with the base addr. */
    if (object->opened == true) {
        HwiP_restore(key);

        DebugP_log1("UART:(%p) already in use.", hwAttrs->baseAddr);
        return (NULL);
    }

    object->opened = true;
    HwiP_restore(key);

    /*
     *  Register power dependency. Keeps the clock running in SLP
     *  and DSLP modes.
     */
    Power_setDependency(getPowerMgrId(hwAttrs->baseAddr));
    Power_setDependency(PowerCC3200_PERIPH_UDMA);

    Power_registerNotify(&object->postNotify, PowerCC3200_AWAKE_LPDS,
            postNotifyFxn, (uintptr_t)handle);

    object->readMode       = params->readMode;
    object->writeMode      = params->writeMode;
    object->readTimeout    = params->readTimeout;
    object->writeTimeout   = params->writeTimeout;
    object->readCallback   = params->readCallback;
    object->writeCallback  = params->writeCallback;
    object->readReturnMode = params->readReturnMode;
    object->readDataMode   = params->readDataMode;
    object->writeDataMode  = params->writeDataMode;
    object->readEcho       = params->readEcho;
    object->baudRate       = params->baudRate;
    object->stopBits       = params->stopBits;
    object->dataLength     = params->dataLength;
    object->parityType     = params->parityType;

    /* Set UART variables to defaults. */
    object->writeBuf = NULL;
    object->readBuf = NULL;
    object->writeCount = 0;
    object->readCount = 0;
    object->writeSize = 0;
    object->readSize = 0;
    object->readSem = NULL;
    object->writeSem = NULL;

    HwiP_clearInterrupt(hwAttrs->intNum);

    HwiP_Params_init(&hwiParams);
    hwiParams.arg = (uintptr_t)handle;
    hwiParams.priority = hwAttrs->intPriority;
    object->hwiHandle = HwiP_create(hwAttrs->intNum,
                                    UARTCC3200DMA_hwiIntFxn,
                                    &hwiParams);
    if (object->hwiHandle == NULL) {
        DebugP_log1("UART:(%p) HwiP_create() failed", hwAttrs->baseAddr);
        UARTCC3200DMA_close(handle);
        return (NULL);
    }

    /* Disable the UART interrupt. */
    MAP_UARTIntDisable(hwAttrs->baseAddr,
                      (UART_INT_TX | UART_INT_RX | UART_INT_RT));

    SemaphoreP_Params_init(&semParams);
    semParams.mode = SemaphoreP_Mode_BINARY;

    /* Create semaphores and set callbacks for BLOCKING modes. */
    if (object->writeMode == UART_MODE_BLOCKING) {
        object->writeCallback = &writeSemCallback;

        object->writeSem = SemaphoreP_create(0, &semParams);
        if (object->writeSem == NULL) {
            UARTCC3200DMA_close(handle);
            DebugP_log1("UART:(%p) Failed to create semaphore.",
                        hwAttrs->baseAddr);
            return (NULL);
        }
    }

    if (object->readMode == UART_MODE_BLOCKING) {
        object->readCallback = &readSemCallback;

        object->readSem = SemaphoreP_create(0, &semParams);
        if (object->readSem == NULL) {
            UARTCC3200DMA_close(handle);
            DebugP_log1("UART:(%p) Failed to create semaphore.",
                        hwAttrs->baseAddr);
            return (NULL);
        }
    }

    /*
     *  Clock object to ensure FIFO is drained before releasing Power
     *  constraints.
     */
    ClockP_Params_init(&clockParams);
    clockParams.arg = (uintptr_t)handle;

    object->txFifoEmptyClk = ClockP_create((ClockP_Fxn)&writeFinishedDoCallback,
                                           &(clockParams));

    if (object->txFifoEmptyClk == NULL) {
        UARTCC3200DMA_close(handle);
        DebugP_log1("UART:(%p) ClockP_create() failed.",
                    hwAttrs->baseAddr);
        return (NULL);
    }

    /* Initialize the hardware */
    initHw(handle);

    if (uDMAControlBase == NULL) {
        uDMAControlBase = MAP_uDMAControlBaseGet();
    }

    DebugP_log1("UART:(%p) opened", hwAttrs->baseAddr);

    /* Return the handle */
    return (handle);
}

/*
 *  ======== UARTCC3200DMA_read ========
 */
int UARTCC3200DMA_read(UART_Handle handle, void *buffer, size_t size)
{
    uintptr_t             key;
    UARTCC3200DMA_Object *object = handle->object;

    /* DMA cannot handle transfer sizes > 1024 elements */
    if (size > MAXXFERSIZE) {
        DebugP_log1("UART:(%p) Data size too large.",
                    ((UARTCC3200DMA_HWAttrs const *)(handle->hwAttrs))->baseAddr);

        return (UART_ERROR);
    }

    /* Disable preemption while checking if the uart is in use. */
    key = HwiP_disable();
    if (object->readSize) {
        HwiP_restore(key);

        DebugP_log1("UART:(%p) Could not read data, uart in use.",
                    ((UARTCC3200DMA_HWAttrs const *)(handle->hwAttrs))->baseAddr);
        return (UART_ERROR);
    }

