DemonTu/ALL_SmartBatterySwitch_CC2640/tirtos_simplelink_2_13_00_06/packages/ti/drivers/uart/UARTCC3200DMA.c
    /* Save the data to be read and restore interrupts. */
    object->readBuf = buffer;
    object->readSize = size;
    object->readCount = 0;

    /* Set constraints to guarantee transaction */
    Power_setConstraint(PowerCC3200_DISALLOW_DEEPSLEEP);

    /*
     *  Start the DMA transfer.  Do this inside the critical
     *  section to prevent UARTCC3200DMA_readCancel() being called
     *  after object->readSize is set, but before the DMA is
     *  configured.  If that happened, the size in the DMA control
     *  register would be 0, causing UARTCC3200DMA_readCancel()
     *  to assume all bytes were transferred.
     */
    UARTCC3200DMA_configDMA(handle, false /* isWrite */);

    HwiP_restore(key);

    /* If readMode is blocking, block and get the status. */
    if (object->readMode == UART_MODE_BLOCKING) {

        /* Pend on semaphore and wait for Hwi to finish. */
        if (SemaphoreP_pend(object->readSem, object->readTimeout) !=
            SemaphoreP_OK) {
            key = HwiP_disable();

            /* Cancel the DMA without posting the semaphore */
            (void)readCancel(handle);

            /*
             *  If ISR ran after timeout, but before the call to
             *  readCancel(), readSem would be posted. Pend on
             *  the semaphore with 0 timeout so the next read
             *  will block.
             */
            if (object->readCount == size) {
                SemaphoreP_pend(object->readSem, 0);
            }

            HwiP_restore(key);

            DebugP_log2("UART:(%p) Read timed out, %d bytes read",
                        ((UARTCC3200DMA_HWAttrs const *)(handle->hwAttrs))->baseAddr,
                        object->readCount);

        }
        return (object->readCount);
    }

    return (0);
}

/*
 *  ======== UARTCC3200DMA_readPolling ========
 */
int UARTCC3200DMA_readPolling(UART_Handle handle, void *buf, size_t size)
{
    int32_t                      count = 0;
    UARTCC3200DMA_Object        *object = handle->object;
    UARTCC3200DMA_HWAttrs const *hwAttrs = handle->hwAttrs;
    unsigned char               *buffer = (unsigned char *)buf;

    /* Read characters. */
    while (size) {
        *buffer = MAP_UARTCharGet(hwAttrs->baseAddr);
        DebugP_log2("UART:(%p) Read character 0x%x",
                    hwAttrs->baseAddr, *buffer);
        count++;
        size--;

        if (object->readDataMode == UART_DATA_TEXT && *buffer == '\r') {
            /* Echo character if enabled. */
            if (object->readEcho) {
                MAP_UARTCharPut(hwAttrs->baseAddr, '\r');
            }
            *buffer = '\n';
        }

        /* Echo character if enabled. */
        if (object->readEcho) {
            MAP_UARTCharPut(hwAttrs->baseAddr, *buffer);
        }

        /* If read return mode is newline, finish if a newline was received. */
        if (object->readReturnMode == UART_RETURN_NEWLINE &&
            *buffer == '\n') {
            return (count);
        }

        buffer++;
    }

    DebugP_log2("UART:(%p) Read polling finished, %d bytes read",
                hwAttrs->baseAddr, count);

    return (count);
}

/*
 *  ======== UARTCC3200DMA_readCancel ========
 */
void UARTCC3200DMA_readCancel(UART_Handle handle)
{
    UARTCC3200DMA_Object *object = handle->object;
    size_t                size;

    /* Stop any ongoing DMA read */
    size = readCancel(handle);

    if (size == 0) {
        return;
    }

    if (object->readMode == UART_MODE_CALLBACK) {
        object->readCallback(handle, object->readBuf, object->readCount);
    }
    else if (object->readMode == UART_MODE_BLOCKING) {
        /* We don't know if we're in an ISR, but we'll assume not. */
        SemaphoreP_post(object->readSem);
    }

    DebugP_log1("UART:(%p) Read canceled, 0 bytes read",
                ((UARTCC3200DMA_HWAttrs const *)(handle->hwAttrs))->baseAddr);
}

/*
 *  ======== UARTCC3200DMA_write ========
 */
int UARTCC3200DMA_write(UART_Handle handle, const void *buffer, size_t size)
{
    uintptr_t             key;
    UARTCC3200DMA_Object *object = handle->object;

    /* DMA cannot handle transfer sizes > 1024 elements */
    if (size > MAXXFERSIZE) {
        DebugP_log1("UART:(%p) Data size too large.",
                    ((UARTCC3200DMA_HWAttrs const *)(handle->hwAttrs))->baseAddr);

        return (UART_ERROR);
    }

    /*
     *  Disable preemption while checking if the uart is in use.
     *
     *  TODO: Using the value of object-writeSize to determine if
     *  the UART is in use, is technically not correct.  If the ISR
     *  just completed and set object->writeSize to 0, this test
     *  would fall through, setting object->writeCount to 0.  This
     *  may be ok in CALLBACK mode where the callback is called from
     *  the ISR, but could be a problem in BLOCKING mode.
     */
    key = HwiP_disable();
    if (object->writeSize) {
        HwiP_restore(key);
        DebugP_log1("UART:(%p) Could not write data, uart in use.",
                    ((UARTCC3200DMA_HWAttrs const *)(handle->hwAttrs))->baseAddr);

        return (UART_ERROR);
    }

    /* Save the data to be written and restore interrupts. */
    object->writeBuf = buffer;
    object->writeCount = 0;
    object->writeSize = size;

    /* Set constraints to guarantee transaction */
    Power_setConstraint(PowerCC3200_DISALLOW_DEEPSLEEP);

    UARTCC3200DMA_configDMA(handle, true /* isWrite */);

    HwiP_restore(key);

    /* If writeMode is blocking, block and get the status. */
    if (object->writeMode == UART_MODE_BLOCKING) {
        /* Pend on semaphore and wait for Hwi to finish. */
        if (SemaphoreP_pend(object->writeSem, object->writeTimeout) !=
            SemaphoreP_OK) {

            key = HwiP_disable();

            /* Stop any ongoing DMA writes and release Power constraints. */
            (void)writeCancel(handle);

            /*
             *  If ISR ran after timeout, but before the call to
             *  writeCancel(), writeSem would be posted. Pend on
             *  the semaphore so the next write call will block.
             */
            if (object->writeCount == size) {
                SemaphoreP_pend(object->writeSem, 0);
            }

            HwiP_restore(key);

            DebugP_log2("UART:(%p) Write timed out, %d bytes written",
                        ((UARTCC3200DMA_HWAttrs const *)(handle->hwAttrs))->baseAddr,
                        object->writeCount);

