DemonTu/ALL_SmartBatterySwitch_CC2640/tirtos_simplelink_2_13_00_06/packages/ti/drivers/uart/UARTCC3200DMA.c
        }
        return (object->writeCount);
    }

    return (0);
}

/*
 *  ======== UARTCC3200DMA_writePolling ========
 */
int UARTCC3200DMA_writePolling(UART_Handle handle, const void *buf, size_t size)
{
    int32_t                      count = 0;
    UARTCC3200DMA_Object        *object = handle->object;
    UARTCC3200DMA_HWAttrs const *hwAttrs = handle->hwAttrs;
    unsigned char               *buffer = (unsigned char *)buf;

    /* Write characters. */
    while (size) {
        if (object->writeDataMode == UART_DATA_TEXT && *buffer == '\n') {
            MAP_UARTCharPut(hwAttrs->baseAddr, '\r');
            count++;
        }
        MAP_UARTCharPut(hwAttrs->baseAddr, *buffer);

        DebugP_log2("UART:(%p) Wrote character 0x%x",
                    ((UARTCC3200DMA_HWAttrs const *)(handle->hwAttrs))->baseAddr,
                    *buffer);
        buffer++;
        count++;
        size--;
    }

    DebugP_log2("UART:(%p) Write polling finished, %d bytes written",
                ((UARTCC3200DMA_HWAttrs const *)(handle->hwAttrs))->baseAddr,
                count);

    return (count);
}

/*
 *  ======== UARTCC3200DMA_writeCancel ========
 */
void UARTCC3200DMA_writeCancel(UART_Handle handle)
{
    UARTCC3200DMA_Object *object = handle->object;
    size_t                size;

    /* Stop any ongoing DMA transmits */
    size = writeCancel(handle);

    if (size == 0) {
        return;
    }

    if (object->writeMode == UART_MODE_CALLBACK) {
        object->writeCallback(handle, (uint8_t*)object->writeBuf,
                object->writeCount);
    }
    else  if (object->writeMode == UART_MODE_BLOCKING) {
        /* We don't know if we're in an ISR, but we'll assume not. */
        SemaphoreP_post(object->writeSem);
    }

    DebugP_log2("UART:(%p) Write canceled, %d bytes written",
                ((UARTCC3200DMA_HWAttrs const *)(handle->hwAttrs))->baseAddr,
                object->writeCount);
}

/*
 *  ======== UARTCC3200DMA_configDMA ========
 *  Call with interrupts disabled.
 */
static void UARTCC3200DMA_configDMA(UART_Handle handle, bool isWrite)
{
    UARTCC3200DMA_Object           *object = handle->object;
    UARTCC3200DMA_HWAttrs const    *hwAttrs = handle->hwAttrs;
    unsigned long                   channelControlOptions;

    if (isWrite) {
        channelControlOptions = UDMA_SIZE_8 | UDMA_SRC_INC_8 |
                UDMA_DST_INC_NONE | UDMA_ARB_4;

        MAP_uDMAChannelControlSet(hwAttrs->txChannelIndex | UDMA_PRI_SELECT,
                channelControlOptions);

        MAP_uDMAChannelTransferSet(hwAttrs->txChannelIndex | UDMA_PRI_SELECT,
                UDMA_MODE_BASIC,
                (void *)object->writeBuf,
                (void *)(hwAttrs->baseAddr + UART_O_DR),
                object->writeSize);

        /*
         *  Enable the DMA channel
         *  This sets the channel's corresponding bit in the uDMA ENASET register.
         *  The bit will be cleared when the transfer completes.
         */
        MAP_uDMAChannelEnable(hwAttrs->txChannelIndex);

        MAP_UARTIntClear(hwAttrs->baseAddr, UART_INT_DMATX);
        MAP_UARTIntEnable(hwAttrs->baseAddr, UART_INT_DMATX);
    }
    else {
        channelControlOptions = UDMA_SIZE_8 | UDMA_SRC_INC_NONE |
                UDMA_DST_INC_8 | UDMA_ARB_4;

        MAP_uDMAChannelControlSet(hwAttrs->rxChannelIndex | UDMA_PRI_SELECT,
                channelControlOptions);

        MAP_uDMAChannelTransferSet(hwAttrs->rxChannelIndex | UDMA_PRI_SELECT,
                UDMA_MODE_BASIC,
                (void *)(hwAttrs->baseAddr + UART_O_DR),
                object->readBuf,
                object->readSize);

        /* Enable DMA Channel */
        MAP_uDMAChannelEnable(hwAttrs->rxChannelIndex);

        MAP_UARTIntClear(hwAttrs->baseAddr, UART_INT_DMARX);
        MAP_UARTIntEnable(hwAttrs->baseAddr, UART_INT_DMARX);
    }

    DebugP_log1("UART:(%p) DMA transfer enabled", hwAttrs->baseAddr);

    if (isWrite) {
        DebugP_log3("UART:(%p) DMA transmit, txBuf: %p; Count: %d",
                    hwAttrs->baseAddr, (uintptr_t)(object->writeBuf),
                    object->writeSize);
    }
    else {
        DebugP_log3("UART:(%p) DMA receive, rxBuf: %p; Count: %d",
                    hwAttrs->baseAddr, (uintptr_t)(object->readBuf),
                    object->readSize);
    }
}

/*
 *  ======== UARTCC3200DMA_hwiIntFxn ========
 *  Hwi function that processes UART interrupts.
 *
 *  Three UART interrupts are enabled: Transmit FIFO is 4/8 empty,
 *  receive FIFO is 4/8 full and a receive timeout between the time
 *  the last character was received.
 *
 *  @param(arg)         The UART_Handle for this Hwi.
 */
static void UARTCC3200DMA_hwiIntFxn(uintptr_t arg)
{
    uint32_t                     status;
    UARTCC3200DMA_Object        *object = ((UART_Handle)arg)->object;
    UARTCC3200DMA_HWAttrs const *hwAttrs = ((UART_Handle)arg)->hwAttrs;

    /*
     *  Clear interrupts
     *    UARTIntStatus(base, false) - read the raw interrupt status
     *    UARTIntStatus(base, true)  - read masked interrupt status
     */
    status = MAP_UARTIntStatus(hwAttrs->baseAddr, false);
    if (status & UART_INT_DMATX) {
        MAP_UARTIntDisable(hwAttrs->baseAddr, UART_INT_DMATX);
        MAP_UARTIntClear(hwAttrs->baseAddr, UART_INT_DMATX);
    }

    if (status & UART_INT_DMARX) {
        MAP_UARTIntDisable(hwAttrs->baseAddr, UART_INT_DMARX);
        MAP_UARTIntClear(hwAttrs->baseAddr, UART_INT_DMARX);
    }

    DebugP_log2("UART:(%p) Interrupt with mask 0x%x",
                hwAttrs->baseAddr, status);

    /* Read data if characters are available. */
    if (object->readSize &&
                !MAP_uDMAChannelIsEnabled(hwAttrs->rxChannelIndex)) {
        object->readCount = object->readSize;
        object->readSize = 0;
        object->readCallback((UART_Handle)arg, object->readBuf,
                object->readCount);

        Power_releaseConstraint(PowerCC3200_DISALLOW_DEEPSLEEP);

        DebugP_log2("UART:(%p) Read finished, %d bytes read",
                    hwAttrs->baseAddr, object->readCount);
    }

    /* Write completed. */
    if (object->writeSize &&
                !MAP_uDMAChannelIsEnabled(hwAttrs->txChannelIndex)) {
        object->writeCount = object->writeSize;
        object->writeSize = 0;
        /*
         *  No more to write, but data is not shifted out yet.
         *  Start TX FIFO Empty clock.
         *  + 4 because it is 4 bytes left in TX FIFO when the TX FIFO
         *  threshold interrupt occurs.
         *  TODO: Should not be 4, if we're using TX1_8.  With 1 msec
         *  Clock tick, maybe this isn't necessary.
         */
        // TEST necessity of FIFO drain clock
#if 1
        startTxFifoEmptyClk((UART_Handle)arg, 4, true);
#else
        object->writeCallback((UART_Handle)arg, (uint8_t*)object->writeBuf,
                object->writeCount);

        Power_releaseConstraint(PowerCC3200_DISALLOW_DEEPSLEEP);
#endif
        DebugP_log2("UART:(%p) Write finished, %d bytes written",
                    hwAttrs->baseAddr, object->writeCount);
    }
}

