DemonTu/ALL_SmartBatterySwitch_CC2640/tirtos_simplelink_2_13_00_06/packages/ti/drivers/uart/UARTCC3200DMA.c
/*
 *  ======== getPowerMgrId ========
 */
static unsigned int getPowerMgrId(unsigned int baseAddr)
{
    switch (baseAddr) {
        case UARTA0_BASE:
            return (PowerCC3200_PERIPH_UARTA0);
        case UARTA1_BASE:
            return (PowerCC3200_PERIPH_UARTA1);
        default:
            return ((unsigned int)-1);
    }
}

/*
 *  ======== initHw ========
 *  Initialize the hardware.
 */
static void initHw(UART_Handle handle)
{
    ClockP_FreqHz               freq;
    UARTCC3200DMA_Object        *object = handle->object;
    UARTCC3200DMA_HWAttrs const *hwAttrs = handle->hwAttrs;

    /*
     *  Set the FIFO level to 4/8 empty and 4/8 full.
     *  The UART generates a burst request based on the FIFO trigger
     *  level. The arbitration size should be set to the amount
     *  of data that the FIFO can transfer when the trigger level is reached.
     *  Since arbitration size is a power of 2, we'll set the FIFO levels
     *  to 4_8 so they can match the arbitration size of 4.
     */
    MAP_UARTFIFOLevelSet(hwAttrs->baseAddr, UART_FIFO_TX4_8, UART_FIFO_RX4_8);

    ClockP_getCpuFreq(&freq);
    MAP_UARTConfigSetExpClk(hwAttrs->baseAddr,
                            freq.lo,
                            object->baudRate,
                            dataLength[object->dataLength] |
                            stopBits[object->stopBits] |
                            parityType[object->parityType]);

    MAP_UARTDMAEnable(hwAttrs->baseAddr, UART_DMA_TX | UART_DMA_RX);

    /* Configure DMA for TX and RX */
    MAP_uDMAChannelAssign(hwAttrs->txChannelIndex);
    MAP_uDMAChannelAttributeDisable(hwAttrs->txChannelIndex, UDMA_ATTR_ALTSELECT);

    MAP_uDMAChannelAssign(hwAttrs->rxChannelIndex);
    MAP_uDMAChannelAttributeDisable(hwAttrs->rxChannelIndex, UDMA_ATTR_ALTSELECT);
    MAP_UARTEnable(hwAttrs->baseAddr);
}

/*
 *  ======== postNotifyFxn ========
 *  Called by Power module when waking up from LPDS.
 */
static int postNotifyFxn(unsigned int eventType, uintptr_t eventArg,
        uintptr_t clientArg)
{
    MAP_uDMAEnable();
    MAP_uDMAControlBaseSet(uDMAControlBase);

    initHw((UART_Handle)clientArg);

    return (Power_NOTIFYDONE);
}

/*
 *  ======== readCancel ========
 *  Stop the current DMA receive transfer.
 */
static size_t readCancel(UART_Handle handle)
{
    uintptr_t                    key;
    UARTCC3200DMA_Object        *object = handle->object;
    UARTCC3200DMA_HWAttrs const *hwAttrs = handle->hwAttrs;
    uint32_t                     remainder;
    int                          bytesTransferred;
    size_t                       size;

    /* Disable interrupts to avoid reading data while changing state. */
    key = HwiP_disable();

    size = object->readSize;

    /* Return if there is no read. */
    if (!object->readSize) {
        HwiP_restore(key);
        return (size);
    }

    /* Set channel bit in the ENACLR register */
    MAP_uDMAChannelDisable(hwAttrs->rxChannelIndex);

    remainder = MAP_uDMAChannelSizeGet(hwAttrs->rxChannelIndex);
    bytesTransferred = object->readSize - remainder;

    /*
     *  Since object->readSize != 0, the ISR has not run and released
     *  the Power constraint.  Release the constraint here.  Setting
     *  object->readSize to 0 will prevent the ISR from releasing the
     *  constraint in case it is pending.
     */
    Power_releaseConstraint(PowerCC3200_DISALLOW_DEEPSLEEP);

    /* Set size = 0 to prevent reading and restore interrupts. */
    object->readSize = 0;
    object->readCount = bytesTransferred;

    HwiP_restore(key);

    return (size);
}

/*
 *  ======== readSemCallback ========
 *  Simple callback to post a semaphore for the blocking mode.
 */
static void readSemCallback(UART_Handle handle, void *buffer, size_t count)
{
    UARTCC3200DMA_Object *object = handle->object;

    SemaphoreP_postFromISR(object->readSem);
}

/*
 *  ======== writeSemCallback ========
 *  Simple callback to post a semaphore for the blocking mode.
 */
static void writeSemCallback(UART_Handle handle, void *buffer, size_t count)
{
    UARTCC3200DMA_Object *object = handle->object;

    SemaphoreP_postFromISR(object->writeSem);
}

/*
 *  ======== writeCancel ========
 */
static size_t writeCancel(UART_Handle handle)
{
    uintptr_t                    key;
    UARTCC3200DMA_Object        *object = handle->object;
    UARTCC3200DMA_HWAttrs const *hwAttrs = handle->hwAttrs;
    uint32_t                     remainder;
    int                          bytesTransferred;
    size_t                       size;

    /* Disable interrupts to avoid writing data while changing state. */
    key = HwiP_disable();

    size = object->writeSize;

    /* Set channel bit in the ENACLR register */
    MAP_uDMAChannelDisable(hwAttrs->txChannelIndex);

    remainder = MAP_uDMAChannelSizeGet(hwAttrs->txChannelIndex);
    bytesTransferred = object->writeSize - remainder;

    /* Return if there is no write. */
    if (!object->writeSize) {
        HwiP_restore(key);

        return (size);
    }

    /*
     *  If the transfer didn't complete, the ISR will not run to
     *  release the Power constraint, so do it here.
     */
    if (bytesTransferred < object->writeSize) {
        Power_releaseConstraint(PowerCC3200_DISALLOW_DEEPSLEEP);
    }

    /* Set size = 0 to prevent writing and restore interrupts. */
    object->writeSize = 0;
    object->writeCount = bytesTransferred;

    HwiP_restore(key);

    return (size);
}

/*
 *  ======== startTxFifoEmptyClk ========
 *  Last write to TX FIFO is done, but not shifted out yet. Start a clock
 *  which will trigger when the TX FIFO should be empty.
 *
 *  @param(handle)         The UART_Handle for ongoing write.
 *  @param(numData)        The number of data present in FIFO after last write
 */
static void startTxFifoEmptyClk(UART_Handle handle, unsigned int numData,
                                bool inIsr)
{
    UARTCC3200DMA_Object *object = handle->object;
    unsigned int writeTimeout;
    unsigned int ticksPerSec;

