DemonTu/ALL_SmartBatterySwitch_CC2640/tirtos_simplelink_2_13_00_06/packages/ti/drivers/uart/UARTCC3200DMA.c
    /* No more to write, but data is not shiftet out properly yet.
     *   1. Compute appropriate wait time for FIFO to empty out
     *       - 8 - for maximum data length
     *       - 3 - for one start bit and maximum of two stop bits
     */
    ticksPerSec = 1000000 / ClockP_getSystemTickPeriod();
    writeTimeout = ((numData * (8 + 3) * ticksPerSec) + object->baudRate - 1)
                           / object->baudRate;

    /*   2. Configure clock object to trigger when FIFO is empty */
    // TODO: Pass inISR to ClockP functions instead?
    if (inIsr) {
        ClockP_startFromISR(object->txFifoEmptyClk, writeTimeout);
    }
    else {
        ClockP_start(object->txFifoEmptyClk, writeTimeout);
    }
}

/*
 *  ======== writeFinishedDoCallback ========
 *  Write finished - make callback
 *
 *  This function is called when the txFifoEmptyClk times out. The TX FIFO
 *  should now be empty.  Standby is allowed again.
 *
 *  @param(handle)         The UART_Handle for ongoing write.
 */
static void writeFinishedDoCallback(UART_Handle handle)
{
    UARTCC3200DMA_Object           *object;
    UARTCC3200DMA_HWAttrs const    *hwAttrs;

    /* Get the pointer to the object and hwAttrs */
    object = handle->object;
    hwAttrs = handle->hwAttrs;

    /* Stop the txFifoEmpty clock */
    ClockP_stop((ClockP_Handle)object->txFifoEmptyClk);

    /*   1. Function verifies that the FIFO is empty via BUSY flag */
    /*   2. Polls this flag if not yet ready (should not be necessary) */
    /*   TODO: remove while, use another clock wait instead */
    while (MAP_UARTBusy(hwAttrs->baseAddr));

    /* Release constraint since transaction is done */
    Power_releaseConstraint(PowerCC3200_DISALLOW_DEEPSLEEP);

#if 0  // TODO: CC26XX driver does this.  Check why this is necessary.
    /* Disable TX interrupt */
    MAP_UARTIntDisable(hwAttrs->baseAddr, UART_INT_TX);

    /* Disable TX */
    HWREG(UART0_BASE + UART_O_CTL) &= ~(UART_CTL_TXE);
#endif

    /* Make callback */
    object->writeCallback(handle, (uint8_t *)object->writeBuf,
                          object->writeCount);
    DebugP_log2("UART:(%p) Write finished, %d bytes written",
                hwAttrs->baseAddr, object->writeCount);
}
